Revit 2026 API

# DisplacementElementRemoveDisplacedElement Method

---

Remove a displaced element from this DisplacementElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveDisplacedElement(
	Element ElemToRemove
)
```
```vb
Public Sub RemoveDisplacedElement (
	ElemToRemove As Element
)
```
```cpp
public:
void RemoveDisplacedElement(
	Element^ ElemToRemove
)
```
```fsharp
member RemoveDisplacedElement :
        ElemToRemove : Element -> unit
```

#### Parameters

ElemToRemove Element
     The element to remove.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace